Author: <a href = "https://github.com/Sumanth2905">Sumanth K</a>
<br>ID: GO_STP_11068

Q1) Discuss the concept of One-Hot-Encoding, Multicollinearity and the Dummy Variable Trap.  What is Nominal and Ordinal Variables ?

**Ans.** 

**One Hot Encoding:**

Machine learning algorithms cannot work directly with categorical data and they must be transformed into numeric values before training a model. Most common type of categorical encoding is One Hot Encoding (also known as dummy encoding) where each categorical level becomes a separate feature in the dataset containing binary values (1 or 0). For example, when the data is ordinal i.e. data has intrinsic levels, ordinal encoding must be used. One Hot Encoding works on all features that are either inferred as categorical or are forced as categorical using categorical_features parameter within setup.

**Multicollinearity:**

In regression, "multicollinearity" refers to predictors that are correlated with other predictors. Multicollinearity occurs when your model includes multiple factors that are correlated not just to your response variable, but also to each other. In other words, it results when you have factors that are a bit redundant.

**Dummy Variable Trap:**

The Dummy Variable trap is a scenario in which the independent variables are multicollinear - a scenario in which two or more variables are highly correlated; in simple terms one variable can be predicted from the others.

**Nominal Variables:**

A nominal variable is a type of variable that is used to name, label or categorize particular attributes that are being measured. It takes qualitative values representing different categories, and there is no intrinsic ordering of these categories.
You can code nominal variables with numbers, but the order is arbitrary and arithmetic operations cannot be performed on the numbers. This is the case when a personâ€™s phone number, National Identification Number postal code, etc. are being collected.
A nominal variable is one of the 2 types of categorical variables and is the simplest among all the measurement variables. Some examples of nominal variables include gender, Name, phone, etc.

**Ordinal Variables:**

Ordinal variable is a type of measurement variable that takes values with an order or rank. It is the 2nd level of measurement and is an extension of the nominal variable.
They are built upon nominal scales by assigning numbers to objects to reflect a rank or ordering on an attribute. Also, there is no standard ordering in the ordinal variable scale.
In another sense, we could say the difference in the rank of an ordinal variable is not equal. It is mostly classified as one of the 2 types of categorical variables, while in some cases it is said to be a midpoint between categorical and numerical variables.

Q2) Salary Dataset of 52 professors having categorical columns. Apply dummy variables concept and one-hot-encoding on categorical columns.

Dataset Link- <a href='https://data.princeton.edu/wws509/datasets/salary.dat'>
Click here </a>

In [1]:
import numpy as np
import pandas as pd

df= pd.read_table('employee.txt', delim_whitespace=True)
df.head()

       sx    rk  yr         dg  yd     sl
0    male  full  25  doctorate  35  36350
1    male  full  13  doctorate  22  35350
2    male  full  10  doctorate  23  28200
3  female  full   7  doctorate  27  26775
4    male  full  19    masters  30  33696

In [2]:
df.shape

(52, 6)

In [3]:
df.describe()

              yr         yd            sl
count  52.000000  52.000000     52.000000
mean    7.480769  16.115385  23797.653846
std     5.507536  10.222340   5917.289154
min     0.000000   1.000000  15000.000000
25%     3.000000   6.750000  18246.750000
50%     7.000000  15.500000  23719.000000
75%    11.000000  23.250000  27258.500000
max    25.000000  35.000000  38045.000000

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sx      52 non-null     object
 1   rk      52 non-null     object
 2   yr      52 non-null     int64
 3   dg      52 non-null     object
 4   yd      52 non-null     int64
 5   sl      52 non-null     int64
dtypes: int64(3), object(3)
memory usage: 2.6+ KB

In [5]:
pd.get_dummies(df,columns=['sx','rk','dg'],drop_first=True).head()

   yr  yd     sl  sx_male  rk_associate  rk_full  dg_masters
0  25  35  36350        1             0        1           0
1  13  22  35350        1             0        1           0
2  10  23  28200        1             0        1           0
3   7  27  26775        0             0        1           0
4  19  30  33696        1             0        1           1

In [6]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer
ct= ColumnTransformer([('encoder',OneHotEncoder(),[0,1,3])], remainder='passthrough')
data= np.array(ct.fit_transform(df), dtype=str)
print(data[:7])

[['0.0' '1.0' '0.0' '0.0' '1.0' '1.0' '0.0' '25.0' '35.0' '36350.0']
 ['0.0' '1.0' '0.0' '0.0' '1.0' '1.0' '0.0' '13.0' '22.0' '35350.0']
 ['0.0' '1.0' '0.0' '0.0' '1.0' '1.0' '0.0' '10.0' '23.0' '28200.0']
 ['1.0' '0.0' '0.0' '0.0' '1.0' '1.0' '0.0' '7.0' '27.0' '26775.0']
 ['0.0' '1.0' '0.0' '0.0' '1.0' '0.0' '1.0' '19.0' '30.0' '33696.0']
 ['0.0' '1.0' '0.0' '0.0' '1.0' '1.0' '0.0' '16.0' '21.0' '28516.0']
 ['1.0' '0.0' '0.0' '0.0' '1.0' '0.0' '1.0' '0.0' '32.0' '24900.0']]